{
  "bottom_navigation": {
    "home": "Trang chủ",
    "chat": "Tư vấn trò chuyện",
    "resume": "Viết hồ sơ",
    "community/board": "Cộng đồng",
    "consultation_center": "Trung tâm tư vấn",
    "community": "Cộng đồng",
    "center": "Trung tâm tư vấn"
  },
  "home_grid": {
    "center": {
      "title": "Trung Tâm Tư Vấn Trực Tiếp",
      "subtitle": "Tìm các trung tâm tư vấn trực tiếp gần đây"
    },
    "community": {
      "title": "Cộng Đồng",
      "subtitle": "Không gian để kết nối với lao động nước ngoài khác"
    },
    "resume": {
      "title": "Viết CV",
      "subtitle": "Tạo CV của riêng bạn dễ dàng bằng AI"
    },
    "chat": {
      "title": "Tư Vấn Trực Tuyến",
      "subtitle": "Tư vấn trò chuyện trực tuyến 24/7 về các mối quan tâm của bạn"
    },
    "call_bot": {
      "title": "Call Bot",
      "subtitle": "Call bot 24/7 lắng nghe những lo lắng của bạn"
    }
  },
  "splash_page": {
    "language_select": "Chọn ngôn ngữ"
  },
  "offline_center_page": {
    "title": "Trung Tâm Tư Vấn Trực Tiếp"
  },
  "chat_page": {
    "title": "Tư Vấn Trò Chuyện",
    "input_hint": "Nhập nội dung bạn muốn tư vấn"
  },
  "resume_page": {
    "restart": "Bắt Đầu Lại",
    "resume": {
      "title": "Viết Sơ Yếu Lý Lịch",
      "next": "Tiếp Theo",
      "back": "Quay Lại",
      "submit": "Gửi"
    },
    "visa": {
      "subtitle": "Vui lòng nhập thông tin visa hiện tại của bạn",
      "acquired": "Tôi đã có visa",
      "planning": "Tôi dự định xin visa",
      "select_visa": "Vui lòng chọn loại visa",
      "select_visa_title": "Chọn loại visa",
      "issue_date": "Ngày Cấp",
      "expiry_date": "Ngày Hết Hạn"
    },
    "work_experience": {
      "subtitle": "Vui lòng nhập kinh nghiệm làm việc của bạn",
      "company_name": "Nhập tên công ty",
      "job_title": "Nhập chức danh công việc",
      "start_date": "Ngày Bắt Đầu",
      "company_name_title": "Tên Công Ty",
      "job_title_title": "Chức Danh Công Việc",
      "end_date": "Ngày Kết Thúc",
      "main_content": "Vui lòng mô tả chi tiết công việc và kinh nghiệm của bạn"
    },
    "personal_info": {
      "subtitle": "Vui lòng nhập thông tin cá nhân của bạn",
      "birth_date": "Ngày Sinh",
      "nationality": "Quốc Tịch",
      "select_nationality": "Chọn quốc tịch",
      "residence": "Nơi Cư Trú",
      "email": "Email",
      "phone_number": "Số Điện Thoại",
      "verify": "Xác Minh",
      "gender": "Giới Tính",
      "select_gender": "Chọn giới tính"
    },
    "korean_ability": {
      "subtitle": "Vui lòng nhập trình độ tiếng Hàn của bạn",
      "language_level": "Trình Độ Ngôn Ngữ",
      "select_language_level": "Vui lòng nhập trình độ tiếng Hàn của bạn",
      "test_name": "Tên Kỳ Thi Chính Thức",
      "score": "Điểm / Xếp Hạng"
    },
    "education": {
      "subtitle": "Vui lòng nhập thông tin giáo dục của bạn",
      "school_name": "Tên Trường / Tổ Chức",
      "major": "Ngành Học / Khóa Học",
      "start_date": "Ngày Bắt Đầu",
      "end_date": "Ngày Kết Thúc",
      "main_content": "Vui lòng mô tả chi tiết những gì bạn đã học",
      "character_limit": "{current}/{max} ký tự đã nhập"
    },
    "certificate": {
      "subtitle": "Vui lòng nhập thông tin chứng chỉ / bằng cấp của bạn",
      "name": "Chứng Chỉ / Bằng Cấp",
      "organization": "Tổ Chức Cấp",
      "acquisition_date": "Ngày Cấp",
      "expiry_date": "Ngày Hết Hạn",
      "main_content": "Vui lòng mô tả chi tiết những gì bạn đã học"
    }
  },
  "terms_page": {
    "title": "Điều khoản sử dụng",
    "look_details": "Xem chi tiết",
    "snackbar": "Bạn phải đồng ý với tất cả các điều khoản.",
    "all_agree": "Đồng ý tất cả",
    "privacy_policy": "Đồng ý với Chính sách quyền riêng tư (Bắt buộc)",
    "terms_of_service": "Đồng ý với Điều khoản dịch vụ (Bắt buộc)",
    "privacy_policy_details": "Dịch vụ HelloWorld (sau đây gọi là 'Dịch vụ') được cung cấp bởi nhóm phát triển (sau đây gọi là 'Nhóm'). Nhóm coi trọng việc bảo vệ thông tin cá nhân và hướng dẫn cách xử lý thông tin cá nhân thu thập được trong quá trình sử dụng Dịch vụ như sau:\n\n1. Các loại thông tin cá nhân được thu thập\n- Thông tin thu thập khi đăng ký tài khoản: Thông tin tài khoản KakaoTalk, biệt danh\n- Thông tin thu thập thêm: Ảnh đại diện, thông tin My Team, v.v.\n\n2. Mục đích xử lý thông tin cá nhân\n- Cung cấp dịch vụ và quản lý thành viên\n- Ngăn chặn hành vi gian lận và cải thiện Dịch vụ\n- Thu thập và phân tích thống kê về việc sử dụng dịch vụ\n\n3. Thời gian lưu trữ và xử lý thông tin cá nhân\n- Thông tin cá nhân sẽ được xử lý và lưu trữ trong khoảng thời gian theo quy định của pháp luật.\n- Thông tin cá nhân sẽ bị xóa trong vòng 90 ngày sau khi ngừng sử dụng dịch vụ.\n\n4. Cung cấp thông tin cá nhân cho bên thứ ba\n- Thông tin cá nhân sẽ không được cung cấp cho bên thứ ba nếu không có sự đồng ý của thành viên.\n\n5. Biện pháp bảo vệ thông tin cá nhân\n- Nhóm áp dụng nhiều công nghệ bảo mật khác nhau để bảo vệ thông tin cá nhân.\n\n6. Quyền và nghĩa vụ của thành viên\n- Thành viên có thể xem, chỉnh sửa hoặc xóa thông tin cá nhân của mình bất cứ lúc nào và thực hiện các quyền liên quan đến việc xử lý thông tin cá nhân.\n\n7. Xóa thông tin cá nhân\n- Khi mục đích xử lý thông tin cá nhân đã đạt được, thông tin sẽ bị xóa ngay lập tức.",
    "terms_of_service_details": "Điều khoản này quy định các điều kiện sử dụng dịch vụ HelloWorld (sau đây gọi là 'Dịch vụ') và nêu rõ quyền và nghĩa vụ giữa nhà cung cấp dịch vụ và thành viên.\n\n1. Cung cấp dịch vụ\n- Dịch vụ HelloWorld cung cấp nhiều tính năng và nội dung khác nhau cho thành viên, và việc sử dụng phải tuân theo điều khoản này.\n\n2. Nghĩa vụ của thành viên\n- Thành viên không được xâm phạm quyền của người khác hoặc cản trở hoạt động bình thường của Dịch vụ.\n- Hành vi bất hợp pháp hoặc phạm tội gây hại cho Dịch vụ có thể dẫn đến hạn chế sử dụng dịch vụ.\n\n3. Hạn chế sử dụng dịch vụ\n- Nếu phát hiện hành vi gian lận hoặc vi phạm điều khoản, Nhóm có thể hạn chế quyền sử dụng dịch vụ hoặc đình chỉ tài khoản của thành viên.\n\n4. Bảo vệ thông tin cá nhân\n- Thông tin cá nhân thu thập trong quá trình sử dụng Dịch vụ sẽ được xử lý theo Chính sách quyền riêng tư của Nhóm, và thành viên có thể yêu cầu chỉnh sửa hoặc xóa thông tin cá nhân bất cứ lúc nào.\n\n5. Thay đổi và gián đoạn dịch vụ\n- Nhóm có thể thay đổi hoặc ngừng cung cấp Dịch vụ vì lý do kỹ thuật hoặc vận hành.\n\n6. Thay đổi điều khoản\n- Nhóm có thể thay đổi điều khoản này để cải thiện dịch vụ hoặc tuân thủ các thay đổi của pháp luật. Điều khoản đã sửa đổi sẽ có hiệu lực sau khi được thông báo.\n\n7. Miễn trừ trách nhiệm\n- Nhóm không chịu trách nhiệm pháp lý về các vấn đề phát sinh trong quá trình sử dụng Dịch vụ, và thành viên phải chịu mọi trách nhiệm về hậu quả khi sử dụng Dịch vụ.\n\n8. Luật áp dụng và giải quyết tranh chấp\n- Điều khoản này tuân theo luật pháp Hàn Quốc, và các tranh chấp liên quan đến việc sử dụng Dịch vụ sẽ được giải quyết tại tòa án nơi Nhóm đặt trụ sở."
  },
  "login_page": {
    "google_login": "Đăng nhập bằng Google"
  },
  "main_content": "Nội dung chính",
  "app_name": "Trung Tâm Hỗ Trợ Ngoại Ngữ AICC",
  "login_button": "Đăng nhập",
  "select_language": "Vui lòng chọn ngôn ngữ",
  "lan_en": "Tiếng Anh",
  "lan_ko": "Tiếng Hàn",
  "lan_ja": "Tiếng Nhật",
  "lan_zh": "Tiếng Trung",
  "lan_vi": "Tiếng Việt",
  "cancel_button": "Hủy",
  "confirm_button": "Xác nhận",
  "chat_consultation": "Tư vấn qua chat",
  "call_bot": "Gọi Bot",
  "resume_writing": "Viết hồ sơ",
  "job_information": "Thông tin việc làm",
  "home": "Trang chủ",
  "chat": "Chat",
  "profile": "Hồ sơ",
  "hello_message": "Chào! Tôi là chatbot của bạn 😀 \n\nĐể bắt đầu, hãy nhấn vào nút bên dưới hoặc nhập một tin nhắn. \n\nLưu ý rằng thông tin do AI cung cấp có thể không chính xác và chỉ nên được sử dụng để tham khảo.",
  "start_button": "Bắt đầu",
  "choose_question": "Vui lòng chọn câu hỏi của bạn. \n\nĐể quay lại, hãy nhập 'Start'.",
  "answer_message": "Tôi sẽ trả lời về {content}. \nĐể hỏi thêm, hãy nhập tin nhắn của bạn. \nĐể quay lại, hãy nhập '{start_button}'.",
  "law": "Luật",
  "visa": "Thị thực",
  "employment": "Việc làm",
  "living": "Sống",
  "help_needed": "Không. Tôi cần giúp đỡ.",
  "input_hint": "Nhập tin nhắn của bạn",
  "resumeTitle": "Hồ sơ",
  "autoGenerateResume": "Tự động tạo hồ sơ",
  "manageResume": "Quản lý hồ sơ",
  "buttonText": "Chọn từ khóa",
  "textFieldHint": "Nhập tiêu đề của bạn tại đây",
  "infoSectionTitle": "Yunseo",
  "phone": "010-1234-5678",
  "email": "1234@gmail.com",
  "intro": "Chào, tôi là Yunseo, một nhà phát triển đa nền tảng.",
  "experienceTitle": "Kinh nghiệm",
  "educationTitle": "Giáo dục",
  "skillsTitle": "Kỹ năng kỹ thuật",
  "certificationsTitle": "Chứng chỉ",
  "projectsTitle": "Dự án",
  "projectA": "Dự án A: Phát triển ứng dụng mua sắm với Flutter",
  "projectB": "Dự án B: Hệ thống gợi ý dựa trên học máy",
  "startButton": "Bắt đầu",
  "inputHint": "Nhập tin nhắn của bạn",
  "resume": {
    "experienceTitle": "Kinh nghiệm",
    "educationTitle": "Giáo dục",
    "skillsTitle": "Kỹ năng",
    "certificationsTitle": "Chứng chỉ",
    "projectsTitle": "Dự án",
    "experience": {
      "company": "Hyundai",
      "duration": "2022.01 ~ 2024.08",
      "position": "Thực tập sinh phần mềm",
      "details": {
        "detail1": "Cải thiện hiệu suất ứng dụng bằng cách xác định và sửa lỗi, dẫn đến việc tăng tốc ứng dụng lên 15%.",
        "detail2": "Đóng góp vào việc triển khai thành công một tính năng mới, dẫn đến việc tăng cường sự tương tác của người dùng lên 20%.",
        "detail3": "Nâng cao độ ổn định của ứng dụng bằng cách thực hiện kiểm tra kỹ lưỡng và giải quyết các vấn đề quan trọng, giảm thiểu sự cố xuống 25%."
      }
    },
    "education": {
      "institution": "Đại học Quốc gia Seoul",
      "duration": "2017.03 ~ 2021.02",
      "degree": "Cử nhân Khoa học Máy tính",
      "details": {
        "detail1": "Tham gia nghiên cứu về các thuật toán học máy.",
        "detail2": "Phát triển ứng dụng di động như một phần của dự án cuối khóa, được trao giải dự án xuất sắc nhất trong lớp.",
        "detail3": "Hoàn thành khóa học về cấu trúc dữ liệu, thuật toán và kỹ thuật phần mềm với điểm số cao nhất."
      }
    },
    "skills": {
      "languages": "Ngôn ngữ lập trình: Dart, Java, Python",
      "frameworks": "Các framework: Flutter, Spring Boot",
      "databases": "Cơ sở dữ liệu: MySQL, MongoDB",
      "tools": "Công cụ: Git, Docker, Jenkins",
      "others": "Khác: RESTful APIs, Phát triển Agile"
    },
    "certifications": {
      "cert1": "Chứng nhận Nhà phát triển Android Cấp độ Associate của Google",
      "cert2": "Chứng nhận Kiến trúc sư giải pháp AWS – Cấp độ Associate",
      "cert3": "Chứng nhận ScrumMaster (CSM)"
    },
    "projects": {
      "projectA": {
        "title": "Dự án A: Phát triển ứng dụng mua sắm với Flutter",
        "duration": "2023.03 ~ 2023.12",
        "description": "Phát triển ứng dụng mua sắm với giao diện người dùng thân thiện. Các tính năng chính bao gồm giỏ hàng, theo dõi đơn hàng và hệ thống đánh giá của người dùng.",
        "contribution": "Đóng góp: Phát triển frontend và backend, tích hợp API"
      },
      "projectB": {
        "title": "Dự án B: Hệ thống gợi ý dựa trên học máy",
        "duration": "2022.06 ~ 2022.12",
        "description": "Phát triển hệ thống cung cấp gợi ý cá nhân hóa bằng cách phân tích hành vi người dùng. Thực hiện phân tích dữ liệu và đào tạo mô hình.",
        "contribution": "Đóng góp: Tiền xử lý dữ liệu, đào tạo và đánh giá mô hình, phân tích kết quả"
      }
    }
  },
  "change_locale_button": "Thay đổi ngôn ngữ",
  "my_page": "Trang của tôi",
  "keywords": "Chọn từ khóa",
  "chatRooms": "Phòng chat",
  "chat_title": "Hello World Chatbot à?",
  "jobTitle": "Cơ hội việc làm",
  "search": "Nhập truy vấn tìm kiếm",
  "languages": {
    "en": "Tiếng Anh",
    "ko": "Tiếng Hàn",
    "ja": "Tiếng Nhật",
    "zh": "Tiếng Trung",
    "vi": "Tiếng Việt"
  },
  "result_count_text": "4 kết quả",
  "job_dummy_items": {
    "item0": {
      "job": "Nhà phát triển Android",
      "company": "Blind",
      "companyLoc": "Seoul",
      "detail": {
        "area": "IT",
        "employed": "toàn thời gian"
      },
      "registred_date": "2024-08-24",
      "end_date": "2024-09-13"
    },
    "item1": {
      "job": "Kỹ sư phát triển phần mềm Android",
      "company": "Accenture",
      "companyLoc": "Pangyo",
      "detail": {
        "area": "Trò chơi",
        "employed": "bán thời gian"
      },
      "registred_date": "2024-09-01",
      "end_date": "Bất kỳ lúc nào"
    },
    "item2": {
      "job": "Kỹ sư phần mềm Android",
      "company": "Tiktok",
      "companyLoc": "Seoul",
      "detail": {
        "area": "IT",
        "employed": "toàn thời gian"
      },
      "registred_date": "2024-08-13",
      "end_date": "2024-09-30"
    },
    "item3": {
      "job": "Kỹ sư SDK Android",
      "company": "Sendbird",
      "companyLoc": "Jeju",
      "detail": {
        "area": "IT",
        "employed": "bán thời gian"
      },
      "registred_date": "2024-08-02",
      "end_date": "Bất kỳ lúc nào"
    }
  },
  "registered_date": "Ngày đăng ký",
  "end_date": "Ngày kết thúc",
  "apply_button": "Nộp đơn",
  "auth_success_login": "Đăng nhập thành công. ",
  "auth_sign_in_with_google": "Đăng nhập bằng Google",
  "auth_login_title": "Trung tâm hỗ trợ người nước ngoài AICC\nHello World",
  "auth_account_is_null": "GoogleSignInAccount là null.",
  "auth_unknown_token_type": "Loại mã thông báo không tồn tại.",
  "app_unkown_error": "Đã xảy ra lỗi không xác định.",
  "mypage_signout_dialog": "Bạn có muốn đăng xuất không?",
  "mypage_no_profile": "Không có hồ sơ",
  "mypage_title": "Trang cá nhân",
  "mypage_edit_profile": "Chỉnh sửa hồ sơ",
  "mypage_change_nickname": "Thay đổi biệt danh",
  "mypage_change_language": "Thay đổi ngôn ngữ",
  "mypage_privacy_policy": "Chính sách bảo mật",
  "mypage_privacy_policy_body": "Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật Chính sách bảo mật",
  "mypage_terms_title": "Điều khoản dịch vụ",
  "mypage_terms_body": "Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ Điều khoản dịch vụ",
  "mypage_withdraw_title": "Hủy tài khoản",
  "mypage_withdraw_body": "Bạn có chắc chắn muốn hủy tài khoản không? Sau khi hủy tài khoản, tất cả dữ liệu của bạn sẽ bị xóa và không thể khôi phục lại được. Bạn có chắc chắn muốn hủy tài khoản không? Sau khi hủy tài khoản, tất cả dữ liệu của bạn sẽ bị xóa và không thể khôi phục lại được. Bạn có chắc chắn muốn hủy tài khoản không? Sau khi hủy tài khoản, tất cả dữ liệu của bạn sẽ bị xóa và không thể khôi phục lại được. Bạn có chắc chắn muốn hủy tài khoản không? Sau khi hủy tài khoản, tất cả dữ liệu của bạn sẽ bị xóa và không thể khôi phục lại được.",
  "mypage_withdraw_confirm_button": "Hủy tài khoản",
  "mypage_menu_edit_profile_title": "Hồ sơ",
  "mypage_menu_edit_profile_description": "Thay đổi hồ sơ",
  "mypage_menu_etc": "Khác",
  "mypage_menu_account_and_info": "Tài khoản và thông tin",
  "mypage_account_account": "Tài khoản",
  "mypage_account_logout": "Đăng xuất",
  "mypage_account_withdraw": "Hủy tài khoản",
  "mypage_account_helloWorld": "HelloWorld",
  "mypage_account_infomation": "Thông tin",
  "mypage_account_appversion": "Phiên bản ứng dụng",
  "mypage_account_terms": "Điều khoản dịch vụ",
  "mypage_account_privacy_policy": "Chính sách bảo mật"
}
